tap "polymarket/polymarket-cli", "https://github.com/Polymarket/polymarket-cli"
tap "steipete/tap"
tap "tksohishi/tap"
brew "agent-browser"
brew "act"
brew "awscli"
brew "caddy"
brew "coreutils"
brew "direnv"
brew "dnsmasq"
brew "fd"
brew "foundry"
brew "gemini-cli"
brew "gh"
brew "gitleaks"
brew "glow"
brew "go"
brew "httpie"
brew "gogcli"
brew "jq"
brew "just"
brew "libusb"
brew "mas"
brew "mise"
brew "pandoc"
brew "polymarket"
brew "poppler"
brew "render"
brew "ripgrep"
brew "rustup"
brew "seats"
brew "sheets"
brew "starship"
brew "summarize"
brew "tgcli"
brew "tig"
brew "tmux"
brew "tree"
brew "uv"
brew "wayfinder"
brew "zoxide"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "antigravity"
cask "brave-browser"
cask "chatgpt-atlas"
cask "claude"
cask "cursor"
cask "discord"
cask "dropbox"
cask "firefox"
cask "font-inter"
cask "font-jetbrains-mono-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-sf-pro"
cask "ghostty"
cask "google-chrome"
cask "gcloud-cli"
cask "google-japanese-ime" # Password prompt: input method
cask "granola"
cask "ledger-wallet"
cask "libreoffice"
cask "logi-options+"
cask "microsoft-office" # Password prompt: installer pkg
cask "notion-calendar"
cask "obsidian"
cask "rectangle"
cask "simple-comic"
cask "slack"
cask "spokenly"
cask "spotify"
cask "ticktick"
cask "visual-studio-code" # Password prompt: shell command
cask "zed"
cask "zoom" # Password prompt: audio device

mas "CotEditor", id: 1024640650
mas "Day One", id: 1055511498
mas "Keynote", id: 409183694
mas "NordVPN", id: 905953485
mas "Pages", id: 409201541
mas "Speedtest", id: 1153157709
mas "Tailscale", id: 1475387142
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
# Manual install: Claude Code (claude install)
cask "codex-app"
# Manual install: OpenUsage (https://github.com/robinebers/openusage/releases)
mas "Xcode", id: 497799835
