brew "act"
brew "awscli"
brew "cmake"
brew "coreutils"
brew "direnv"
brew "gh"
brew "go"
brew "htop"
brew "jq"
brew "just"
brew "libusb"
brew "mas"
brew "mysql"
brew "pandoc"
brew "poppler"
brew "postgresql@14", restart_service: :changed
brew "redis", restart_service: :changed
brew "ripgrep"
brew "starship"
brew "tig"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "zoxide"
cask "1password"
cask "alfred"
cask "antigravity"
cask "aqua-voice"
cask "audio-hijack"
cask "brave-browser"
cask "chatgpt"
cask "chatgpt-atlas"
cask "claude"
cask "cmd-eikana"
cask "codex-app"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "dropbox"
cask "firefox"
cask "ghostty"
cask "google-chrome"
cask "google-japanese-ime"
cask "granola"
cask "ledger-wallet"
cask "libreoffice"
cask "logi-options+"
cask "notion-calendar"
cask "rectangle"
cask "session-manager-plugin"
cask "simple-comic"
cask "slack"
cask "spotify"
cask "ticktick"
cask "visual-studio-code"
cask "zoom"

mas "CotEditor", id: 1024640650
mas "Day One", id: 1055511498
mas "Keynote", id: 409183694
mas "NordVPN", id: 905953485
mas "Pages", id: 409201541
mas "Speedtest", id: 1153157709
mas "Tailscale", id: 1475387142
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
# Manual install: DaVinci Resolve (https://www.blackmagicdesign.com/products/davinciresolve)
mas "Xcode", id: 497799835
